reports/k6_100k_readiness.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts\load\k6_100k_readiness.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m10s max duration (incl. graceful stop):
              * smoke_readiness: Up to 50 looping VUs for 2m0s over 3 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m00.8s), 01/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   1% ] 01/50 VUs  0m00.8s/2m00.0s

running (0m01.8s), 02/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   2% ] 02/50 VUs  0m01.8s/2m00.0s

running (0m02.8s), 03/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   2% ] 03/50 VUs  0m02.8s/2m00.0s

running (0m04.0s), 04/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   3% ] 04/50 VUs  0m04.0s/2m00.0s

running (0m04.8s), 04/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   4% ] 04/50 VUs  0m04.8s/2m00.0s

running (0m06.0s), 05/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   5% ] 05/50 VUs  0m06.0s/2m00.0s

running (0m07.0s), 06/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   6% ] 06/50 VUs  0m07.0s/2m00.0s

running (0m08.0s), 07/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   7% ] 07/50 VUs  0m08.0s/2m00.0s

running (0m08.9s), 08/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   7% ] 08/50 VUs  0m08.9s/2m00.0s

running (0m09.8s), 08/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   8% ] 08/50 VUs  0m09.8s/2m00.0s

running (0m10.9s), 09/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [   9% ] 09/50 VUs  0m10.9s/2m00.0s

running (0m11.8s), 10/50 VUs, 0 complete and 0 interrupted iterations
smoke_readiness   [  10% ] 10/50 VUs  0m11.8s/2m00.0s

running (0m12.9s), 11/50 VUs, 1 complete and 0 interrupted iterations
smoke_readiness   [  11% ] 11/50 VUs  0m12.9s/2m00.0s

running (0m13.8s), 12/50 VUs, 1 complete and 0 interrupted iterations
smoke_readiness   [  11% ] 12/50 VUs  0m13.8s/2m00.0s

running (0m14.8s), 12/50 VUs, 2 complete and 0 interrupted iterations
smoke_readiness   [  12% ] 12/50 VUs  0m14.8s/2m00.0s

running (0m15.8s), 13/50 VUs, 2 complete and 0 interrupted iterations
smoke_readiness   [  13% ] 13/50 VUs  0m15.8s/2m00.0s

running (0m16.8s), 14/50 VUs, 3 complete and 0 interrupted iterations
smoke_readiness   [  14% ] 14/50 VUs  0m16.8s/2m00.0s

running (0m17.8s), 15/50 VUs, 3 complete and 0 interrupted iterations
smoke_readiness   [  15% ] 15/50 VUs  0m17.8s/2m00.0s

running (0m18.8s), 16/50 VUs, 5 complete and 0 interrupted iterations
smoke_readiness   [  16% ] 16/50 VUs  0m18.8s/2m00.0s

running (0m19.8s), 16/50 VUs, 5 complete and 0 interrupted iterations
smoke_readiness   [  16% ] 16/50 VUs  0m19.8s/2m00.0s

running (0m20.8s), 17/50 VUs, 5 complete and 0 interrupted iterations
smoke_readiness   [  17% ] 17/50 VUs  0m20.8s/2m00.0s

running (0m21.8s), 18/50 VUs, 5 complete and 0 interrupted iterations
smoke_readiness   [  18% ] 18/50 VUs  0m21.8s/2m00.0s

running (0m22.9s), 19/50 VUs, 6 complete and 0 interrupted iterations
smoke_readiness   [  19% ] 19/50 VUs  0m22.9s/2m00.0s

running (0m23.8s), 20/50 VUs, 6 complete and 0 interrupted iterations
smoke_readiness   [  20% ] 20/50 VUs  0m23.8s/2m00.0s

running (0m24.9s), 20/50 VUs, 6 complete and 0 interrupted iterations
smoke_readiness   [  21% ] 20/50 VUs  0m24.9s/2m00.0s

running (0m25.8s), 21/50 VUs, 7 complete and 0 interrupted iterations
smoke_readiness   [  21% ] 21/50 VUs  0m25.8s/2m00.0s

running (0m26.8s), 22/50 VUs, 7 complete and 0 interrupted iterations
smoke_readiness   [  22% ] 22/50 VUs  0m26.8s/2m00.0s

running (0m27.8s), 23/50 VUs, 7 complete and 0 interrupted iterations
smoke_readiness   [  23% ] 23/50 VUs  0m27.8s/2m00.0s

running (0m28.9s), 23/50 VUs, 7 complete and 0 interrupted iterations
smoke_readiness   [  24% ] 23/50 VUs  0m28.9s/2m00.0s

running (0m30.1s), 25/50 VUs, 7 complete and 0 interrupted iterations
smoke_readiness   [  25% ] 25/50 VUs  0m30.1s/2m00.0s

running (0m31.0s), 25/50 VUs, 7 complete and 0 interrupted iterations
smoke_readiness   [  26% ] 25/50 VUs  0m31.0s/2m00.0s

running (0m31.8s), 25/50 VUs, 7 complete and 0 interrupted iterations
smoke_readiness   [  26% ] 25/50 VUs  0m31.8s/2m00.0s

running (0m32.8s), 26/50 VUs, 9 complete and 0 interrupted iterations
smoke_readiness   [  27% ] 26/50 VUs  0m32.8s/2m00.0s

running (0m33.8s), 26/50 VUs, 10 complete and 0 interrupted iterations
smoke_readiness   [  28% ] 26/50 VUs  0m33.8s/2m00.0s

running (0m34.9s), 26/50 VUs, 13 complete and 0 interrupted iterations
smoke_readiness   [  29% ] 26/50 VUs  0m34.9s/2m00.0s

running (0m36.0s), 27/50 VUs, 15 complete and 0 interrupted iterations
smoke_readiness   [  30% ] 27/50 VUs  0m36.0s/2m00.0s

running (0m36.8s), 27/50 VUs, 19 complete and 0 interrupted iterations
smoke_readiness   [  31% ] 27/50 VUs  0m36.8s/2m00.0s

running (0m37.8s), 28/50 VUs, 22 complete and 0 interrupted iterations
smoke_readiness   [  31% ] 28/50 VUs  0m37.8s/2m00.0s

running (0m38.8s), 28/50 VUs, 28 complete and 0 interrupted iterations
smoke_readiness   [  32% ] 28/50 VUs  0m38.8s/2m00.0s

running (0m39.8s), 29/50 VUs, 35 complete and 0 interrupted iterations
smoke_readiness   [  33% ] 29/50 VUs  0m39.8s/2m00.0s

running (0m40.8s), 29/50 VUs, 36 complete and 0 interrupted iterations
smoke_readiness   [  34% ] 29/50 VUs  0m40.8s/2m00.0s

running (0m41.8s), 29/50 VUs, 40 complete and 0 interrupted iterations
smoke_readiness   [  35% ] 29/50 VUs  0m41.8s/2m00.0s

running (0m42.8s), 30/50 VUs, 44 complete and 0 interrupted iterations
smoke_readiness   [  36% ] 30/50 VUs  0m42.8s/2m00.0s

running (0m43.8s), 30/50 VUs, 50 complete and 0 interrupted iterations
smoke_readiness   [  36% ] 30/50 VUs  0m43.8s/2m00.0s

running (0m44.8s), 31/50 VUs, 58 complete and 0 interrupted iterations
smoke_readiness   [  37% ] 31/50 VUs  0m44.8s/2m00.0s

running (0m45.8s), 31/50 VUs, 64 complete and 0 interrupted iterations
smoke_readiness   [  38% ] 31/50 VUs  0m45.8s/2m00.0s

running (0m46.8s), 31/50 VUs, 64 complete and 0 interrupted iterations
smoke_readiness   [  39% ] 31/50 VUs  0m46.8s/2m00.0s

running (0m47.9s), 32/50 VUs, 68 complete and 0 interrupted iterations
smoke_readiness   [  40% ] 32/50 VUs  0m47.9s/2m00.0s

running (0m48.8s), 32/50 VUs, 69 complete and 0 interrupted iterations
smoke_readiness   [  41% ] 32/50 VUs  0m48.8s/2m00.0s

running (0m49.9s), 33/50 VUs, 75 complete and 0 interrupted iterations
smoke_readiness   [  42% ] 33/50 VUs  0m49.9s/2m00.0s

running (0m50.8s), 33/50 VUs, 81 complete and 0 interrupted iterations
smoke_readiness   [  42% ] 33/50 VUs  0m50.8s/2m00.0s

running (0m51.8s), 34/50 VUs, 92 complete and 0 interrupted iterations
smoke_readiness   [  43% ] 34/50 VUs  0m51.8s/2m00.0s

running (0m52.8s), 34/50 VUs, 93 complete and 0 interrupted iterations
smoke_readiness   [  44% ] 34/50 VUs  0m52.8s/2m00.0s

running (0m53.8s), 34/50 VUs, 103 complete and 0 interrupted iterations
smoke_readiness   [  45% ] 34/50 VUs  0m53.8s/2m00.0s

running (0m54.8s), 35/50 VUs, 118 complete and 0 interrupted iterations
smoke_readiness   [  46% ] 35/50 VUs  0m54.8s/2m00.0s

running (0m55.8s), 35/50 VUs, 130 complete and 0 interrupted iterations
smoke_readiness   [  46% ] 35/50 VUs  0m55.8s/2m00.0s

running (0m56.8s), 36/50 VUs, 137 complete and 0 interrupted iterations
smoke_readiness   [  47% ] 36/50 VUs  0m56.8s/2m00.0s

running (0m57.8s), 36/50 VUs, 147 complete and 0 interrupted iterations
smoke_readiness   [  48% ] 36/50 VUs  0m57.8s/2m00.0s

running (0m58.8s), 36/50 VUs, 165 complete and 0 interrupted iterations
smoke_readiness   [  49% ] 36/50 VUs  0m58.8s/2m00.0s

running (0m59.8s), 37/50 VUs, 170 complete and 0 interrupted iterations
smoke_readiness   [  50% ] 37/50 VUs  0m59.8s/2m00.0s

running (1m00.8s), 37/50 VUs, 186 complete and 0 interrupted iterations
smoke_readiness   [  51% ] 37/50 VUs  1m00.8s/2m00.0s

running (1m01.8s), 38/50 VUs, 190 complete and 0 interrupted iterations
smoke_readiness   [  51% ] 38/50 VUs  1m01.8s/2m00.0s

running (1m02.8s), 38/50 VUs, 190 complete and 0 interrupted iterations
smoke_readiness   [  52% ] 38/50 VUs  1m02.8s/2m00.0s

running (1m03.8s), 39/50 VUs, 192 complete and 0 interrupted iterations
smoke_readiness   [  53% ] 39/50 VUs  1m03.8s/2m00.0s

running (1m04.8s), 39/50 VUs, 198 complete and 0 interrupted iterations
smoke_readiness   [  54% ] 39/50 VUs  1m04.8s/2m00.0s

running (1m05.8s), 39/50 VUs, 200 complete and 0 interrupted iterations
smoke_readiness   [  55% ] 39/50 VUs  1m05.8s/2m00.0s

running (1m06.9s), 40/50 VUs, 206 complete and 0 interrupted iterations
smoke_readiness   [  56% ] 40/50 VUs  1m06.9s/2m00.0s

running (1m07.8s), 40/50 VUs, 207 complete and 0 interrupted iterations
smoke_readiness   [  56% ] 40/50 VUs  1m07.8s/2m00.0s

running (1m08.9s), 41/50 VUs, 211 complete and 0 interrupted iterations
smoke_readiness   [  57% ] 41/50 VUs  1m08.9s/2m00.0s

running (1m09.8s), 41/50 VUs, 217 complete and 0 interrupted iterations
smoke_readiness   [  58% ] 41/50 VUs  1m09.8s/2m00.0s

running (1m10.8s), 41/50 VUs, 218 complete and 0 interrupted iterations
smoke_readiness   [  59% ] 41/50 VUs  1m10.8s/2m00.0s

running (1m11.8s), 42/50 VUs, 228 complete and 0 interrupted iterations
smoke_readiness   [  60% ] 42/50 VUs  1m11.8s/2m00.0s

running (1m12.8s), 42/50 VUs, 228 complete and 0 interrupted iterations
smoke_readiness   [  61% ] 42/50 VUs  1m12.8s/2m00.0s

running (1m13.8s), 43/50 VUs, 231 complete and 0 interrupted iterations
smoke_readiness   [  61% ] 43/50 VUs  1m13.8s/2m00.0s

running (1m14.8s), 43/50 VUs, 233 complete and 0 interrupted iterations
smoke_readiness   [  62% ] 43/50 VUs  1m14.8s/2m00.0s

running (1m15.8s), 44/50 VUs, 242 complete and 0 interrupted iterations
smoke_readiness   [  63% ] 44/50 VUs  1m15.8s/2m00.0s

running (1m16.8s), 44/50 VUs, 244 complete and 0 interrupted iterations
smoke_readiness   [  64% ] 44/50 VUs  1m16.8s/2m00.0s

running (1m17.8s), 44/50 VUs, 250 complete and 0 interrupted iterations
smoke_readiness   [  65% ] 44/50 VUs  1m17.8s/2m00.0s

running (1m18.8s), 45/50 VUs, 259 complete and 0 interrupted iterations
smoke_readiness   [  66% ] 45/50 VUs  1m18.8s/2m00.0s

running (1m19.8s), 45/50 VUs, 265 complete and 0 interrupted iterations
smoke_readiness   [  67% ] 45/50 VUs  1m19.8s/2m00.0s

running (1m20.8s), 46/50 VUs, 268 complete and 0 interrupted iterations
smoke_readiness   [  67% ] 46/50 VUs  1m20.8s/2m00.0s

running (1m21.8s), 46/50 VUs, 270 complete and 0 interrupted iterations
smoke_readiness   [  68% ] 46/50 VUs  1m21.8s/2m00.0s

running (1m22.8s), 46/50 VUs, 274 complete and 0 interrupted iterations
smoke_readiness   [  69% ] 46/50 VUs  1m22.8s/2m00.0s

running (1m23.8s), 47/50 VUs, 285 complete and 0 interrupted iterations
smoke_readiness   [  70% ] 47/50 VUs  1m23.8s/2m00.0s

running (1m24.8s), 47/50 VUs, 288 complete and 0 interrupted iterations
smoke_readiness   [  71% ] 47/50 VUs  1m24.8s/2m00.0s

running (1m25.8s), 48/50 VUs, 288 complete and 0 interrupted iterations
smoke_readiness   [  71% ] 48/50 VUs  1m25.8s/2m00.0s

running (1m26.8s), 48/50 VUs, 289 complete and 0 interrupted iterations
smoke_readiness   [  72% ] 48/50 VUs  1m26.8s/2m00.0s

running (1m27.8s), 49/50 VUs, 299 complete and 0 interrupted iterations
smoke_readiness   [  73% ] 49/50 VUs  1m27.8s/2m00.0s

running (1m28.9s), 49/50 VUs, 306 complete and 0 interrupted iterations
smoke_readiness   [  74% ] 49/50 VUs  1m28.9s/2m00.0s

running (1m30.1s), 49/50 VUs, 308 complete and 0 interrupted iterations
smoke_readiness   [  75% ] 49/50 VUs  1m30.1s/2m00.0s

running (1m30.8s), 50/50 VUs, 320 complete and 0 interrupted iterations
smoke_readiness   [  76% ] 50/50 VUs  1m30.8s/2m00.0s

running (1m31.8s), 50/50 VUs, 325 complete and 0 interrupted iterations
smoke_readiness   [  76% ] 50/50 VUs  1m31.8s/2m00.0s

running (1m32.8s), 50/50 VUs, 325 complete and 0 interrupted iterations
smoke_readiness   [  77% ] 50/50 VUs  1m32.8s/2m00.0s

running (1m33.8s), 46/50 VUs, 337 complete and 0 interrupted iterations
smoke_readiness   [  78% ] 46/50 VUs  1m33.8s/2m00.0s

running (1m34.8s), 44/50 VUs, 346 complete and 0 interrupted iterations
smoke_readiness   [  79% ] 44/50 VUs  1m34.8s/2m00.0s

running (1m35.8s), 44/50 VUs, 348 complete and 0 interrupted iterations
smoke_readiness   [  80% ] 44/50 VUs  1m35.8s/2m00.0s

running (1m36.8s), 43/50 VUs, 351 complete and 0 interrupted iterations
smoke_readiness   [  81% ] 43/50 VUs  1m36.8s/2m00.0s

running (1m37.8s), 39/50 VUs, 360 complete and 0 interrupted iterations
smoke_readiness   [  82% ] 39/50 VUs  1m37.8s/2m00.0s

running (1m38.8s), 38/50 VUs, 364 complete and 0 interrupted iterations
smoke_readiness   [  82% ] 38/50 VUs  1m38.8s/2m00.0s

running (1m39.8s), 37/50 VUs, 368 complete and 0 interrupted iterations
smoke_readiness   [  83% ] 37/50 VUs  1m39.8s/2m00.0s

running (1m40.8s), 37/50 VUs, 372 complete and 0 interrupted iterations
smoke_readiness   [  84% ] 37/50 VUs  1m40.8s/2m00.0s

running (1m41.9s), 37/50 VUs, 375 complete and 0 interrupted iterations
smoke_readiness   [  85% ] 37/50 VUs  1m41.9s/2m00.0s

running (1m42.8s), 36/50 VUs, 380 complete and 0 interrupted iterations
smoke_readiness   [  86% ] 36/50 VUs  1m42.8s/2m00.0s

running (1m43.8s), 36/50 VUs, 384 complete and 0 interrupted iterations
smoke_readiness   [  86% ] 36/50 VUs  1m43.8s/2m00.0s

running (1m44.8s), 36/50 VUs, 388 complete and 0 interrupted iterations
smoke_readiness   [  87% ] 36/50 VUs  1m44.8s/2m00.0s

running (1m45.8s), 36/50 VUs, 392 complete and 0 interrupted iterations
smoke_readiness   [  88% ] 36/50 VUs  1m45.8s/2m00.0s

running (1m46.8s), 36/50 VUs, 396 complete and 0 interrupted iterations
smoke_readiness   [  89% ] 36/50 VUs  1m46.8s/2m00.0s

running (1m47.8s), 35/50 VUs, 401 complete and 0 interrupted iterations
smoke_readiness   [  90% ] 35/50 VUs  1m47.8s/2m00.0s

running (1m48.8s), 35/50 VUs, 405 complete and 0 interrupted iterations
smoke_readiness   [  91% ] 35/50 VUs  1m48.8s/2m00.0s

running (1m49.8s), 32/50 VUs, 409 complete and 2 interrupted iterations
smoke_readiness   [  91% ] 32/50 VUs  1m49.8s/2m00.0s

running (1m50.8s), 29/50 VUs, 413 complete and 3 interrupted iterations
smoke_readiness   [  92% ] 29/50 VUs  1m50.8s/2m00.0s

running (1m51.8s), 27/50 VUs, 413 complete and 5 interrupted iterations
smoke_readiness   [  93% ] 27/50 VUs  1m51.8s/2m00.0s

running (1m53.2s), 24/50 VUs, 418 complete and 7 interrupted iterations
smoke_readiness   [  94% ] 24/50 VUs  1m53.2s/2m00.0s

running (1m53.8s), 23/50 VUs, 419 complete and 8 interrupted iterations
smoke_readiness   [  95% ] 23/50 VUs  1m53.8s/2m00.0s

running (1m54.8s), 21/50 VUs, 420 complete and 10 interrupted iterations
smoke_readiness   [  96% ] 21/50 VUs  1m54.8s/2m00.0s

running (1m55.8s), 17/50 VUs, 422 complete and 12 interrupted iterations
smoke_readiness   [  96% ] 17/50 VUs  1m55.8s/2m00.0s

running (1m56.8s), 15/50 VUs, 425 complete and 12 interrupted iterations
smoke_readiness   [  97% ] 15/50 VUs  1m56.8s/2m00.0s

running (1m57.8s), 10/50 VUs, 432 complete and 12 interrupted iterations
smoke_readiness   [  98% ] 10/50 VUs  1m57.8s/2m00.0s

running (1m58.8s), 04/50 VUs, 442 complete and 12 interrupted iterations
smoke_readiness   [  99% ] 04/50 VUs  1m58.8s/2m00.0s

running (1m59.8s), 01/50 VUs, 446 complete and 12 interrupted iterations
smoke_readiness   [ 100% ] 01/50 VUs  1m59.8s/2m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<1000' p(95)=1.05s

    http_req_failed
    ✗ 'rate<0.05' rate=64.45%


  █ TOTAL RESULTS 

    checks_total.......: 2718   22.618283/s
    checks_succeeded...: 69.90% 1900 out of 2718
    checks_failed......: 30.09% 818 out of 2718

    ✓ homepage 200
    ✓ health 200
    ✗ login rejects bad creds safely
      ↳  8%  -  ✓ 40 / ✗ 419
    ✗ assessment responds
      ↳  10%  -  ✓ 48 / ✗ 399
    ✓ anonymous save blocked
    ✓ anonymous document gate blocked

    HTTP
    http_req_duration..............: avg=919.23ms min=9.19ms med=212.22ms max=55.56s p(90)=743.58ms p(95)=1.05s 
      { expected_response:true }...: avg=2.21s    min=9.19ms med=453.91ms max=55.56s p(90)=1.16s    p(95)=2.53s 
    http_req_failed................: 64.45% 1752 out of 2718
    http_reqs......................: 2718   22.618283/s

    EXECUTION
    iteration_duration.............: avg=6.58s    min=1.12s  med=2.97s    max=59.42s p(90)=13.8s    p(95)=33.32s
    iterations.....................: 447    3.719784/s
    vus............................: 1      min=1            max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 10 MB  85 kB/s
    data_sent......................: 553 kB 4.6 kB/s



running (2m00.2s), 00/50 VUs, 447 complete and 12 interrupted iterations
smoke_readiness ✓ [ 100% ] 00/50 VUs  2m0s
time="2026-06-14T02:09:08+01:00" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' have been crossed"